AlecGuerin/NXP-Ignition_coil/LPC824_Ignition_Coil/board/boards/pin_mux.c
    gpio_pin_config_t RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_14 (pin 20)  */
    GPIO_PinInit(BOARD_INITPINS_RST_GPIO, BOARD_INITPINS_RST_PORT, BOARD_INITPINS_RST_PIN, &RST_config);

    IOCON->PIO[8] = ((IOCON->PIO[8] &
                      /* Mask bits to zero which are setting */
                      (~(IOCON_PIO_I2CMODE_MASK)))

                     /* Selects I2C mode.: Standard GPIO functionality. Requires external pull-up for GPIO output
                      * function. */
                     | IOCON_PIO_I2CMODE(PIO0_10_I2CMODE_Standard_GPIO));

    IOCON->PIO[7] = ((IOCON->PIO[7] &
                      /* Mask bits to zero which are setting */
                      (~(IOCON_PIO_I2CMODE_MASK)))

                     /* Selects I2C mode.: Standard GPIO functionality. Requires external pull-up for GPIO output
                      * function. */
                     | IOCON_PIO_I2CMODE(PIO0_11_I2CMODE_Standard_GPIO));

    /* ADC_PINTRIG0 connect to P0_12 */
    SWM_SetMovablePinSelect(SWM0, kSWM_ADC_PINTRIG0, kSWM_PortPin_P0_12);

    /* ACMP_OUT connect to P0_5 */
    SWM_SetMovablePinSelect(SWM0, kSWM_ACMP_OUT, kSWM_PortPin_P0_5);

    /* SPI0_SCK connect to P0_23 */
    SWM_SetMovablePinSelect(SWM0, kSWM_SPI0_SCK, kSWM_PortPin_P0_23);

    /* SPI0_MOSI connect to P0_17 */
    SWM_SetMovablePinSelect(SWM0, kSWM_SPI0_MOSI, kSWM_PortPin_P0_17);

    /* SPI0_SSEL0 connect to P0_0 */
    SWM_SetMovablePinSelect(SWM0, kSWM_SPI0_SSEL0, kSWM_PortPin_P0_0);

    /* SCT_OUT0 connect to P0_13 */
    SWM_SetMovablePinSelect(SWM0, kSWM_SCT_OUT0, kSWM_PortPin_P0_13);

    SYSCON->PINTSEL[0] = ((SYSCON->PINTSEL[0] &
                           /* Mask bits to zero which are setting */
                           (~(SYSCON_PINTSEL_INTPIN_MASK)))

                          /* Pin number select for pin interrupt or pattern match engine input. (PIO0_0 to PIO0_28
                           * correspond to numbers 0 to 28).: 0x01u */
                          | SYSCON_PINTSEL_INTPIN(0x01u));

    SYSCON->PINTSEL[1] = ((SYSCON->PINTSEL[1] &
                           /* Mask bits to zero which are setting */
                           (~(SYSCON_PINTSEL_INTPIN_MASK)))

                          /* Pin number select for pin interrupt or pattern match engine input. (PIO0_0 to PIO0_28
                           * correspond to numbers 0 to 28).: 0x0Au */
                          | SYSCON_PINTSEL_INTPIN(0x0Au));

    SYSCON->PINTSEL[2] = ((SYSCON->PINTSEL[2] &
                           /* Mask bits to zero which are setting */
                           (~(SYSCON_PINTSEL_INTPIN_MASK)))

                          /* Pin number select for pin interrupt or pattern match engine input. (PIO0_0 to PIO0_28
                           * correspond to numbers 0 to 28).: 0x0Bu */
                          | SYSCON_PINTSEL_INTPIN(0x0Bu));

    SYSCON->PINTSEL[3] = ((SYSCON->PINTSEL[3] &
                           /* Mask bits to zero which are setting */
                           (~(SYSCON_PINTSEL_INTPIN_MASK)))

                          /* Pin number select for pin interrupt or pattern match engine input. (PIO0_0 to PIO0_28
                           * correspond to numbers 0 to 28).: 0x0Fu */
                          | SYSCON_PINTSEL_INTPIN(0x0Fu));

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '4', peripheral: GPIO, signal: 'PIO0, 12', pin_signal: PIO0_12, direction: OUTPUT, mode: pullUp, invert: disabled, hysteresis: disabled, opendrain: disabled,
    smode: bypass, clkdiv: div0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M0P */
void BOARD_InitLEDsPins(void)
{
    /* Enables clock for IOCON block.: Enable. */
    CLOCK_EnableClock(kCLOCK_Iocon);
    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t V_PEAK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U,
    };
    /* Initialize GPIO functionality on pin PIO0_12 (pin 4)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_V_PEAK_GPIO, BOARD_INITLEDSPINS_V_PEAK_PORT, BOARD_INITLEDSPINS_V_PEAK_PIN, &V_PEAK_config);

    const uint32_t V_PEAK = (/* Selects pull-up function */
                             IOCON_PIO_MODE_PULLUP |
                             /* Disable hysteresis */
                             IOCON_PIO_HYS_DI |
                             /* Input not invert */
                             IOCON_PIO_INV_DI |
                             /* Disables Open-drain function */
                             IOCON_PIO_OD_DI |
                             /* Bypass input filter */
                             IOCON_PIO_SMODE_BYPASS |
                             /* IOCONCLKDIV0 */
                             IOCON_PIO_CLKDIV0);
    /* PIO0 PIN12 (coords: 4) is configured as GPIO, PIO0, 12. */
    IOCON_PinMuxSet(IOCON, IOCON_INDEX_PIO0_12, V_PEAK);

    /* Disable clock for switch matrix. */
    CLOCK_DisableClock(kCLOCK_Swm);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

